// Під час сабміту форми будемо виводити в консоль значення текстового поля та очищати форму.

const form = document.querySelector(".feedback-form");

form.addEventListener("submit", evt => {
  evt.preventDefault();
	console.log(evt.target.elements.message.value);
  form.reset();
});


// Проблема   Якщо користувач ввів повідомлення в текстове поле і перезавантажив 
// сторінку, не надіславши форму, під час перезавантаження сторінки введене 
// овідомлення пропадає.
// Рішення
// Зробимо так, щоб при перезавантаженні сторінки зберігалося введене повідомлення.
// Для цього використовуємо локальне сховище, щоб зберегти поточне значення текстового поля 
//під час введення.